## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 1 to change, 17 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_api_gateway_account.api_cloudwatch will be destroyed
  - resource "aws_api_gateway_account" "api_cloudwatch" {
      - cloudwatch_role_arn = "arn:aws:iam::806545929748:role/ApiGatewayCloudWatchRole" -> null
      - id                  = "api-gateway-account" -> null
      - throttle_settings   = [
          - {
              - burst_limit = 5000
              - rate_limit  = 10000
            },
        ] -> null
    }

  # aws_api_gateway_base_path_mapping.api will be destroyed
  - resource "aws_api_gateway_base_path_mapping" "api" {
      - api_id      = "zjyu1t6h7e" -> null
      - domain_name = "scan-files.alpha.canada.ca" -> null
      - id          = "scan-files.alpha.canada.ca/" -> null
      - stage_name  = "v1" -> null
    }

  # aws_api_gateway_deployment.api will be destroyed
  - resource "aws_api_gateway_deployment" "api" {
      - created_date      = "2022-06-21T18:09:47Z" -> null
      - execution_arn     = "arn:aws:execute-api:ca-central-1:806545929748:zjyu1t6h7e/" -> null
      - id                = "vu6vmy" -> null
      - invoke_url        = "https://zjyu1t6h7e.execute-api.ca-central-1.amazonaws.com/" -> null
      - rest_api_id       = "zjyu1t6h7e" -> null
      - stage_description = "56862cf9dd0c740796fd7e5d6378cfc1|0d280e0458a9f8a4d7cfbf4d2d6400ac" -> null
    }

  # aws_api_gateway_domain_name.api will be destroyed
  - resource "aws_api_gateway_domain_name" "api" {
      - arn                      = "arn:aws:apigateway:ca-central-1::/domainnames/scan-files.alpha.canada.ca" -> null
      - certificate_upload_date  = "2021-11-29T18:04:32Z" -> null
      - cloudfront_zone_id       = "Z2FDTNDATAQYW2" -> null
      - domain_name              = "scan-files.alpha.canada.ca" -> null
      - id                       = "scan-files.alpha.canada.ca" -> null
      - regional_certificate_arn = "arn:aws:acm:ca-central-1:806545929748:certificate/75f2e70b-e103-45f2-b7d5-3d3b1930f6e0" -> null
      - regional_domain_name     = "d-dt1p5coyo6.execute-api.ca-central-1.amazonaws.com" -> null
      - regional_zone_id         = "Z19DQILCV0OWEC" -> null
      - security_policy          = "TLS_1_2" -> null
      - tags                     = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                 = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null

      - endpoint_configuration {
          - types = [
              - "REGIONAL",
            ] -> null
        }
    }

  # aws_api_gateway_integration.integration will be destroyed
  - resource "aws_api_gateway_integration" "integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "5souaj" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "ANY" -> null
      - id                      = "agi-zjyu1t6h7e-5souaj-ANY" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {
          - "integration.request.path.proxy" = "method.request.path.proxy"
        } -> null
      - request_templates       = {} -> null
      - resource_id             = "5souaj" -> null
      - rest_api_id             = "zjyu1t6h7e" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:806545929748:function:scan-files-api/invocations" -> null
    }

  # aws_api_gateway_integration_response.integration_response will be destroyed
  - resource "aws_api_gateway_integration_response" "integration_response" {
      - http_method         = "ANY" -> null
      - id                  = "agir-zjyu1t6h7e-5souaj-ANY-200" -> null
      - resource_id         = "5souaj" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = ""
        } -> null
      - rest_api_id         = "zjyu1t6h7e" -> null
      - status_code         = "200" -> null
    }

  # aws_api_gateway_method.method will be destroyed
  - resource "aws_api_gateway_method" "method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "ANY" -> null
      - id                   = "agm-zjyu1t6h7e-5souaj-ANY" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.path.proxy" = true
        } -> null
      - resource_id          = "5souaj" -> null
      - rest_api_id          = "zjyu1t6h7e" -> null
    }

  # aws_api_gateway_method_response.api_response_200 will be destroyed
  - resource "aws_api_gateway_method_response" "api_response_200" {
      - http_method         = "ANY" -> null
      - id                  = "agmr-zjyu1t6h7e-5souaj-ANY-200" -> null
      - resource_id         = "5souaj" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Strict-Transport-Security" = true
        } -> null
      - rest_api_id         = "zjyu1t6h7e" -> null
      - status_code         = "200" -> null
    }

  # aws_api_gateway_method_settings.all will be destroyed
  - resource "aws_api_gateway_method_settings" "all" {
      - id          = "zjyu1t6h7e-v1-*/*" -> null
      - method_path = "*/*" -> null
      - rest_api_id = "zjyu1t6h7e" -> null
      - stage_name  = "v1" -> null

      - settings {
          - cache_data_encrypted                       = false -> null
          - cache_ttl_in_seconds                       = 300 -> null
          - caching_enabled                            = false -> null
          - data_trace_enabled                         = false -> null
          - logging_level                              = "ERROR" -> null
          - metrics_enabled                            = true -> null
          - require_authorization_for_cache_control    = true -> null
          - throttling_burst_limit                     = -1 -> null
          - throttling_rate_limit                      = -1 -> null
          - unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> null
        }
    }

  # aws_api_gateway_resource.resource will be destroyed
  - resource "aws_api_gateway_resource" "resource" {
      - id          = "5souaj" -> null
      - parent_id   = "iz05kb697i" -> null
      - path        = "/{proxy+}" -> null
      - path_part   = "{proxy+}" -> null
      - rest_api_id = "zjyu1t6h7e" -> null
    }

  # aws_api_gateway_rest_api.api will be destroyed
  - resource "aws_api_gateway_rest_api" "api" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:ca-central-1::/restapis/zjyu1t6h7e" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2021-11-15T16:54:39Z" -> null
      - description                  = "Proxy to handle requests to our API" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:ca-central-1:806545929748:zjyu1t6h7e" -> null
      - id                           = "zjyu1t6h7e" -> null
      - minimum_compression_size     = -1 -> null
      - name                         = "api-gateway" -> null
      - root_resource_id             = "iz05kb697i" -> null
      - tags                         = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                     = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null

      - endpoint_configuration {
          - types            = [
              - "REGIONAL",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # aws_api_gateway_stage.api will be destroyed
  - resource "aws_api_gateway_stage" "api" {
      - arn                   = "arn:aws:apigateway:ca-central-1::/restapis/zjyu1t6h7e/stages/v1" -> null
      - cache_cluster_enabled = false -> null
      - deployment_id         = "vu6vmy" -> null
      - execution_arn         = "arn:aws:execute-api:ca-central-1:806545929748:zjyu1t6h7e/v1" -> null
      - id                    = "ags-zjyu1t6h7e-v1" -> null
      - invoke_url            = "https://zjyu1t6h7e.execute-api.ca-central-1.amazonaws.com/v1" -> null
      - rest_api_id           = "zjyu1t6h7e" -> null
      - stage_name            = "v1" -> null
      - tags                  = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - variables             = {} -> null
      - xray_tracing_enabled  = false -> null

      - access_log_settings {
          - destination_arn = "arn:aws:logs:ca-central-1:806545929748:log-group:/aws/api-gateway/api-access" -> null
          - format          = jsonencode(
                {
                  - caller         = "$context.identity.caller"
                  - httpMethod     = "$context.httpMethod"
                  - ip             = "$context.identity.sourceIp"
                  - requestId      = "$context.requestId"
                  - requestTime    = "$context.requestTime"
                  - resourcePath   = "$context.resourcePath"
                  - responseLength = "$context.responseLength"
                  - status         = "$context.status"
                }
            ) -> null
        }
    }

  # aws_cloudfront_distribution.scan_files_api will be created
  + resource "aws_cloudfront_distribution" "scan_files_api" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true
      + web_acl_id                     = "ca5274a3-f27b-4562-a21e-5cd0c8c17835"

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "scan-files-api"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + bucket          = "scan-files-production-logs"
          + include_cookies = false
          + prefix          = "cloudfront"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "scan-files-api"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1.2_2021"
        }
    }

  # aws_cloudwatch_log_group.api_access will be destroyed
  - resource "aws_cloudwatch_log_group" "api_access" {
      - arn               = "arn:aws:logs:ca-central-1:806545929748:log-group:/aws/api-gateway/api-access" -> null
      - id                = "/aws/api-gateway/api-access" -> null
      - name              = "/aws/api-gateway/api-access" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_cloudwatch_log_group.api_wskt_access will be destroyed
  - resource "aws_cloudwatch_log_group" "api_wskt_access" {
      - arn               = "arn:aws:logs:ca-central-1:806545929748:log-group:/aws/api-gatewayv2/api-wskt-access" -> null
      - id                = "/aws/api-gatewayv2/api-wskt-access" -> null
      - name              = "/aws/api-gatewayv2/api-wskt-access" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
    }

  # aws_iam_role.api_cloudwatch will be destroyed
  - resource "aws_iam_role" "api_cloudwatch" {
      - arn                   = "arn:aws:iam::806545929748:role/ApiGatewayCloudWatchRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "apigateway.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-11-15T16:54:38Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ApiGatewayCloudWatchRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ApiGatewayCloudWatchRole" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "scan-files-production"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROA3XSPCGYKI4WK2DKBJ" -> null

      - inline_policy {}
    }

  # aws_iam_role_policy_attachment.api_cloudwatch will be destroyed
  - resource "aws_iam_role_policy_attachment" "api_cloudwatch" {
      - id         = "ApiGatewayCloudWatchRole-20211115165439297600000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs" -> null
      - role       = "ApiGatewayCloudWatchRole" -> null
    }

  # aws_lambda_function_url.scan_files_url will be created
  + resource "aws_lambda_function_url" "scan_files_url" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "scan-files-api"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + url_id             = (known after apply)

      + cors {
          + allow_credentials = true
          + allow_methods     = [
              + "*",
            ]
          + allow_origins     = [
              + "*",
            ]
          + max_age           = 86400
        }
    }

  # aws_route53_record.scan_files_A will be updated in-place
  ~ resource "aws_route53_record" "scan_files_A" {
        id      = "Z09208862AM3U6FRXOHM8_scan-files.alpha.canada.ca_A"
        name    = "scan-files.alpha.canada.ca"
        # (5 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d-dt1p5coyo6.execute-api.ca-central-1.amazonaws.com" -> null
          - zone_id                = "Z19DQILCV0OWEC" -> null
        }
      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.api.aws_lambda_permission.api_gateway[0] will be destroyed
  - resource "aws_lambda_permission" "api_gateway" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "scan-files-api" -> null
      - id            = "AllowAPIGatewayInvoke" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:ca-central-1:806545929748:zjyu1t6h7e/*/*" -> null
      - statement_id  = "AllowAPIGatewayInvoke" -> null
    }

Plan: 2 to add, 1 to change, 17 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
